<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Γραμμές Γλώσσας Επαλήθευσης
    |--------------------------------------------------------------------------
    |
    | Οι παρακάτω γραμμές χρησιμοποιούνται κατά την επαλήθευση ταυτότητας
    | για διάφορα μηνύματα που πρέπει να εμφανιστούν στον χρήστη. Μπορείτε
    | να τα προσαρμόσετε ανάλογα με τις ανάγκες της εφαρμογής σας.
    |
    */

    'failed' => 'Αυτά τα στοιχεία δεν αντιστοιχούν στα αρχεία μας.',
    'password' => 'Ο κωδικός που δώσατε είναι λανθασμένος.',
    'throttle' => 'Πάρα πολλές προσπάθειες σύνδεσης. Παρακαλώ δοκιμάστε ξανά σε :seconds δευτερόλεπτα.',

];
