<?php

return [

    /*
     *
     * Κοινές μεταφράσεις.
     *
     */
    'title' => 'Εγκατάσταση Laravel',
    'next' => 'Επόμενο',
    'finish' => 'Εγκατάσταση',

    /*
     *
     * Μεταφράσεις της αρχικής σελίδας.
     *
     */
    'welcome' => [
        'title'   => 'Καλώς ήρθατε στον εγκαταστάτη',
        'message' => 'Καλώς ήρθατε στον οδηγό εγκατάστασης',
    ],

    /*
     *
     * Μεταφράσεις της σελίδας απαιτήσεων.
     *
     */
    'requirements' => [
        'title' => 'Απαιτήσεις',
    ],

    /*
     *
     * Μεταφράσεις της σελίδας αδειών.
     *
     */
    'permissions' => [
        'title' => 'Άδειες',
    ],

    /*
     *
     * Μεταφράσεις της σελίδας περιβάλλοντος.
     *
     */
    'environment' => [
        'title' => 'Ρυθμίσεις περιβάλλοντος',
        'save' => 'Αποθήκευση αρχείου .env',
        'success' => 'Οι αλλαγές στο αρχείο .env σας έχουν αποθηκευτεί.',
        'errors' => 'Δεν είναι δυνατή η δημιουργία του αρχείου .env, παρακαλώ προσπαθήστε χειροκίνητα.',
    ],

    /*
     *
     * Μεταφράσεις της τελικής σελίδας.
     *
     */
    'final' => [
        'title' => 'Ολοκληρώθηκε.',
        'finished' => 'Η εφαρμογή εγκαταστάθηκε επιτυχώς!',
        'exit' => 'Κάντε κλικ εδώ για έξοδο.',
    ],
];
