<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Γραμμές Γλώσσας Σελιδοποίησης
    |--------------------------------------------------------------------------
    |
    | Οι ακόλουθες γραμμές γλώσσας χρησιμοποιούνται από τη βιβλιοθήκη σελιδοποίησης
    | για την κατασκευή των απλών συνδέσμων σελιδοποίησης. Είστε ελεύθεροι να
    | τις αλλάξετε όπως θέλετε για να προσαρμόσετε τις προβολές σας ώστε να
    | ταιριάζουν καλύτερα στην εφαρμογή σας.
    |
    */

    'previous' => '« Προηγούμενο',
    'next' => 'Επόμενο »',

];
