<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Γραμμές Γλώσσας Επαναφοράς Κωδικού Πρόσβασης
    |--------------------------------------------------------------------------
    |
    | Οι ακόλουθες γραμμές γλώσσας είναι οι προεπιλεγμένες γραμμές που ταιριάζουν
    | με τους λόγους που δίνονται από τον διαχειριστή κωδικών πρόσβασης όταν μια
    | προσπάθεια ενημέρωσης κωδικού πρόσβασης απέτυχε, όπως για ένα μη έγκυρο
    | διακριτικό ή μη έγκυρο νέο κωδικό πρόσβασης.
    |
    */

    'reset' => 'Ο κωδικός πρόσβασής σας έχει επαναφερθεί!',
    'sent' => 'Έχουμε στείλει με email τον σύνδεσμο επαναφοράς κωδικού πρόσβασης!',
    'throttled' => 'Παρακαλώ περιμένετε πριν δοκιμάσετε ξανά.',
    'token' => 'Αυτό το διακριτικό επαναφοράς κωδικού πρόσβασης δεν είναι έγκυρο.',
    'user' => "Δεν μπορούμε να βρούμε χρήστη με αυτήν τη διεύθυνση email.",

];
