<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Γραμμές Γλώσσας Επικύρωσης
    |--------------------------------------------------------------------------
    |
    | Οι ακόλουθες γραμμές γλώσσας περιέχουν τα προεπιλεγμένα μηνύματα σφάλματος
    | που χρησιμοποιούνται από την κλάση επικύρωσης. Ορισμένοι από αυτούς
    | τους κανόνες έχουν πολλαπλές εκδόσεις, όπως οι κανόνες μεγέθους.
    | Μη διστάσετε να τροποποιήσετε αυτά τα μηνύματα εδώ.
    |
    */

    'accepted' => 'Το πεδίο :attribute πρέπει να γίνει αποδεκτό.',
    'active_url' => 'Το πεδίο :attribute δεν είναι έγκυρη URL.',
    'after' => 'Το πεδίο :attribute πρέπει να είναι μια ημερομηνία μετά την :date.',
    'after_or_equal' => 'Το πεδίο :attribute πρέπει να είναι μια ημερομηνία μετά ή ίση με την :date.',
    'alpha' => 'Το πεδίο :attribute μπορεί να περιέχει μόνο γράμματα.',
    'alpha_dash' => 'Το πεδίο :attribute μπορεί να περιέχει μόνο γράμματα, αριθμούς, παύλες και κάτω παύλες.',
    'alpha_num' => 'Το πεδίο :attribute μπορεί να περιέχει μόνο γράμματα και αριθμούς.',
    'array' => 'Το πεδίο :attribute πρέπει να είναι ένας πίνακας.',
    'before' => 'Το πεδίο :attribute πρέπει να είναι μια ημερομηνία πριν την :date.',
    'before_or_equal' => 'Το πεδίο :attribute πρέπει να είναι μια ημερομηνία πριν ή ίση με την :date.',
    'between' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μεταξύ :min και :max.',
        'file' => 'Το αρχείο :attribute πρέπει να είναι μεταξύ :min και :max kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να είναι μεταξύ :min και :max χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να έχει μεταξύ :min και :max στοιχεία.',
    ],
    'boolean' => 'Το πεδίο :attribute πρέπει να είναι αληθές ή ψευδές.',
    'confirmed' => 'Η επιβεβαίωση του πεδίου :attribute δεν ταιριάζει.',
    'date' => 'Το πεδίο :attribute δεν είναι έγκυρη ημερομηνία.',
    'date_equals' => 'Το πεδίο :attribute πρέπει να είναι μια ημερομηνία ίση με την :date.',
    'date_format' => 'Το πεδίο :attribute δεν ταιριάζει με τη μορφή :format.',
    'different' => 'Τα πεδία :attribute και :other πρέπει να είναι διαφορετικά.',
    'digits' => 'Το πεδίο :attribute πρέπει να έχει :digits ψηφία.',
    'digits_between' => 'Το πεδίο :attribute πρέπει να έχει μεταξύ :min και :max ψηφία.',
    'dimensions' => 'Το πεδίο :attribute έχει μη έγκυρες διαστάσεις εικόνας.',
    'distinct' => 'Το πεδίο :attribute έχει μια διπλότυπη τιμή.',
    'email' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση email.',
    'ends_with' => 'Το πεδίο :attribute πρέπει να τελειώνει με ένα από τα ακόλουθα: :values.',
    'exists' => 'Το επιλεγμένο :attribute δεν είναι έγκυρο.',
    'file' => 'Το πεδίο :attribute πρέπει να είναι ένα αρχείο.',
    'filled' => 'Το πεδίο :attribute πρέπει να έχει μια τιμή.',
    'gt' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μεγαλύτερο από :value.',
        'file' => 'Το αρχείο :attribute πρέπει να είναι μεγαλύτερο από :value kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει περισσότερους από :value χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να έχει περισσότερα από :value στοιχεία.',
    ],
    'gte' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μεγαλύτερο ή ίσο με :value.',
        'file' => 'Το αρχείο :attribute πρέπει να είναι μεγαλύτερο ή ίσο με :value kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει τουλάχιστον :value χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να έχει τουλάχιστον :value στοιχεία.',
    ],
    'image' => 'Το πεδίο :attribute πρέπει να είναι εικόνα.',
    'in' => 'Το επιλεγμένο :attribute δεν είναι έγκυρο.',
    'in_array' => 'Το πεδίο :attribute δεν υπάρχει στο :other.',
    'integer' => 'Το πεδίο :attribute πρέπει να είναι ακέραιος.',
    'ip' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση IP.',
    'ipv4' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση IPv4.',
    'ipv6' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση IPv6.',
    'json' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη συμβολοσειρά JSON.',
    'lt' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μικρότερο από :value.',
        'file' => 'Το αρχείο :attribute πρέπει να είναι μικρότερο από :value kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει λιγότερους από :value χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να έχει λιγότερα από :value στοιχεία.',
    ],
    'lte' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι μικρότερο ή ίσο με :value.',
        'file' => 'Το αρχείο :attribute πρέπει να είναι μικρότερο ή ίσο με :value kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει το πολύ :value χαρακτήρες.',
        'array' => 'Το πεδίο :attribute δεν πρέπει να έχει περισσότερα από :value στοιχεία.',
    ],
    'max' => [
        'numeric' => 'Το πεδίο :attribute δεν μπορεί να είναι μεγαλύτερο από :max.',
        'file' => 'Το αρχείο :attribute δεν μπορεί να είναι μεγαλύτερο από :max kilobyte.',
        'string' => 'Το πεδίο :attribute δεν μπορεί να έχει περισσότερους από :max χαρακτήρες.',
        'array' => 'Το πεδίο :attribute δεν μπορεί να έχει περισσότερα από :max στοιχεία.',
    ],
    'mimes' => 'Το πεδίο :attribute πρέπει να είναι αρχείο τύπου: :values.',
    'mimetypes' => 'Το πεδίο :attribute πρέπει να είναι αρχείο τύπου: :values.',
    'min' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι τουλάχιστον :min.',
        'file' => 'Το αρχείο :attribute πρέπει να έχει τουλάχιστον :min kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει τουλάχιστον :min χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να έχει τουλάχιστον :min στοιχεία.',
    ],
    'multiple_of' => 'Το πεδίο :attribute πρέπει να είναι πολλαπλάσιο του :value.',
    'not_in' => 'Το επιλεγμένο :attribute δεν είναι έγκυρο.',
    'not_regex' => 'Η μορφή του πεδίου :attribute δεν είναι έγκυρη.',
    'numeric' => 'Το πεδίο :attribute πρέπει να είναι αριθμός.',
    'password' => 'Ο κωδικός πρόσβασης είναι λανθασμένος.',
    'present' => 'Το πεδίο :attribute πρέπει να υπάρχει.',
    'regex' => 'Η μορφή του πεδίου :attribute δεν είναι έγκυρη.',
    'required' => 'Το πεδίο :attribute είναι υποχρεωτικό.',
    'required_if' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν το :other είναι :value.',
    'required_unless' => 'Το πεδίο :attribute είναι υποχρεωτικό εκτός αν το :other βρίσκεται στα :values.',
    'required_with' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν υπάρχουν τα :values.',
    'required_with_all' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν υπάρχουν όλα τα :values.',
    'required_without' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν δεν υπάρχουν τα :values.',
    'required_without_all' => 'Το πεδίο :attribute είναι υποχρεωτικό όταν κανένα από τα :values δεν υπάρχει.',
    'same' => 'Τα πεδία :attribute και :other πρέπει να ταιριάζουν.',
    'size' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι :size.',
        'file' => 'Το αρχείο :attribute πρέπει να έχει :size kilobyte.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει :size χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να περιέχει :size στοιχεία.',
    ],
    'starts_with' => 'Το πεδίο :attribute πρέπει να ξεκινά με ένα από τα ακόλουθα: :values.',
    'string' => 'Το πεδίο :attribute πρέπει να είναι συμβολοσειρά.',
    'timezone' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη ζώνη ώρας.',
    'unique' => 'Το πεδίο :attribute έχει ήδη χρησιμοποιηθεί.',
    'uploaded' => 'Το πεδίο :attribute απέτυχε να μεταφορτωθεί.',
    'url' => 'Η μορφή του πεδίου :attribute δεν είναι έγκυρη.',
    'uuid' => 'Το πεδίο :attribute πρέπει να είναι έγκυρο UUID.',

    /*
    |--------------------------------------------------------------------------
    | Προσαρμοσμένες Γραμμές Γλώσσας Επικύρωσης
    |--------------------------------------------------------------------------
    |
    | Εδώ μπορείτε να καθορίσετε προσαρμοσμένα μηνύματα επικύρωσης για
    | χαρακτηριστικά χρησιμοποιώντας τη σύμβαση "attribute.rule" για την
    | ονομασία των γραμμών. Αυτό μας επιτρέπει να καθορίζουμε γρήγορα
    | μια συγκεκριμένη προσαρμοσμένη γραμμή γλώσσας για έναν δεδομένο
    | κανόνα χαρακτηριστικού.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'προσαρμοσμένο μήνυμα',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Προσαρμοσμένα ονόματα χαρακτηριστικών επικύρωσης
    |--------------------------------------------------------------------------
    |
    | Οι ακόλουθες γραμμές γλώσσας χρησιμοποιούνται για την αντικατάσταση
    | της θέσης μας χαρακτηριστικών με κάτι πιο φιλικό προς τον αναγνώστη,
    | όπως "Διεύθυνση Email" αντί για "email". Αυτό απλά μας βοηθά να κάνουμε
    | το μήνυμά μας πιο εκφραστικό.
    |
    */

    'attributes' => [],

];
